import requests
import psycopg2

s = requests.Session()
s1 = requests.Session()

ordersData = [
    ["Доработать сайт",             "Это описание это описание и все понял ты чорт", "2024-04-01", "10000", "1", "39", "3", "2", "сайт;доработка;питон"],
    ["Разработать логотип",         "Это описание это описание и все понял ты чорт", "2024-05-01", "5000",  "2", "1",  "2", "1", "логотип;дизайн;фотошоп"],
    ["Разработать чат бот",         "Это описание это описание и все понял ты чорт", "2024-06-01", "1000",  "1", "55", "2", "2", "бот;телеграм;питон"],
    ["Созадать мобильный дизайн",   "Это описание это описание и все понял ты чорт", "2024-05-02", "500",   "2", "15", "3", "3", "дизайн;мобильныйтелефон;ui"],
    ["Создать NFT",                 "Это описание это описание и все понял ты чорт", "2024-04-01", "1000",  "2", "12", "3", "2", "nft;блокчейн;golang"],
    ["Нужна инфографика по работе", "Это описание это описание и все понял ты чорт", "2024-07-01", "8000",  "2", "6",  "1", "1", "работа;графики;exel"],
    ["Разработать дизайн тумбочки", "Это описание это описание и все понял ты чорт", "2024-06-09", "8000",  "2", "24", "1", "2", "мебель;дизайн;тумба"],
    ["Нужен дизайн листовки",       "Это описание это описание и все понял ты чорт", "2024-05-20", "7000",  "2", "29", "2", "1", "листовка;внешнийвид;дизайн"],
    ["Разобраться с доменом",       "Это описание это описание и все понял ты чорт", "2024-04-20", "6000",  "1", "62", "3", "2", "сайт;домен"],
    ["Провести тест веб приложения","Это описание это описание и все понял ты чорт", "2024-04-21", "11000",  "1","65", "3", "1", "питон;тестирование;сайт"]
]

offersData = [
    ["Доработаю сайт",               "Это описание это описание и все понял ты чорт", "5",  "10000", "1", "39", "2", "сайт;доработка;питон"],
    ["Разработаю логотип",           "Это описание это описание и все понял ты чорт", "6",  "5000",  "2", "1",  "1", "логотип;дизайн;фотошоп"],
    ["Разработаю чат бот",           "Это описание это описание и все понял ты чорт", "2",  "1000",  "1", "55", "2", "бот;телеграм;питон"],
    ["Созадам мобильный дизайн",     "Это описание это описание и все понял ты чорт", "3",  "500",   "2", "15", "3", "дизайн;мобильныйтелефон;ui"],
    ["Создам NFT",                   "Это описание это описание и все понял ты чорт", "5",  "1000",  "2", "12", "2", "nft;блокчейн;golang"],
    ["Создам инфографика по работе", "Это описание это описание и все понял ты чорт", "4",  "8000",  "2", "6",  "1", "работа;графики;exel"],
    ["Разработаю дизайн тумбочки",   "Это описание это описание и все понял ты чорт", "10", "8000",  "2", "24", "2", "мебель;дизайн;тумба"],
    ["Разработю дизайн листовки",    "Это описание это описание и все понял ты чорт", "11", "7000",  "2", "29", "1", "листовка;внешнийвид;дизайн"],
    ["Разобрусь с доменом",          "Это описание это описание и все понял ты чорт", "2",  "6000",  "1", "62", "2", "сайт;домен"],
    ["Проведу тест веб приложения",  "Это описание это описание и все понял ты чорт", "3",  "11000", "1", "65", "1", "питон;тестирование;сайт"]
]

def fillDataOrders():
    s.post("http://localhost:8080/login", data={'email':'bookgun@mail.ru', 'password': "123"})
    for i in range(50):
        for order in ordersData:
            s.post("http://localhost:8080/account/newOrder", files={'fileTZ': None}, data={'orderName': order[0] + str(i), 'orderDiscribction': order[1], 
            'orderDeadline': order[2], 'orderPrice': order[3], 'orderCategoryFirst': order[4], 'orderCategorySecond': order[5], 'orderUrgency': order[6], 'orderWorkType': order[7], 'orderTags': order[8]})

def fillDataOffers():
    s1.post("http://localhost:8080/login", data={'email':'a@mail.ru', 'password': "123"})
    imgC = 1
    for i in range(50):
        for offer in offersData:
            s1.post("http://localhost:8080/account/newOffer", files={'cover': open("wTestImg/" + str(imgC) + ".jpg", "rb")}, data={'offerName': offer[0], 'offerDiscribtion': offer[1], 
            'offerDaysToComplite': offer[2], 'offerPrice': offer[3], 'offerCategoryFirst': offer[4], 'offerCategorySecond': offer[5], 'offerWorkType': offer[6], 'offerTags': offer[7]})
            imgC +=1
            if imgC == 25:
                imgC = 1

def clearData():
    conn = psycopg2.connect(dbname='test', user='postgres', 
                        password='123', host='127.0.0.1', port="5432")
    cursor = conn.cursor()
    cursor.execute('TRUNCATE orders RESTART IDENTITY')
    cursor.execute('TRUNCATE offers RESTART IDENTITY')
    cursor.close()
    conn.close()

fillDataOrders(); 
fillDataOffers()
#clearData()